const TermsOfUsePage = () => {
  return (
    <>
      <h1>개인정보처리방침</h1>
      <p>
        본 애플리케이션(이하 '앱')은 이용자의 개인정보를 중요하게 생각하며, 관련 법령에 따라
        이용자의 개인정보를 보호하고 있습니다. 본 개인정보처리방침은 앱에서 수집하는 개인정보와 그
        사용 목적, 보유 및 파기, 제3자 제공 여부, 이용자의 권리 등에 대해 설명하고 있습니다.
      </p>

      <h2>1. 개인정보의 수집 항목 및 방법</h2>
      <p>앱은 서비스 제공을 위해 다음과 같은 개인정보를 수집합니다:</p>
      <ul>
        <li>계정 가입 시: 아이디, 비밀번호, 이름, 생년월일, 전화번호, 이메일</li>
        <li>서비스 이용 시: 실시간 위치 정보, 복약 기록, 내방 기록</li>
      </ul>
      <p>
        개인정보는 이용자가 회원가입 시 자발적으로 제공하거나, 서비스 이용 과정에서 자동으로 수집될
        수 있습니다.
      </p>

      <h2>2. 개인정보의 수집 및 이용 목적</h2>
      <p>수집된 개인정보는 다음의 목적을 위해 이용됩니다:</p>
      <ul>
        <li>회원 관리: 회원 식별, 본인 확인, 비밀번호 관리</li>
        <li>서비스 제공: 개인 맞춤형 서비스 제공, 위치 기반 서비스, 복약 및 내방 기록 관리</li>
      </ul>

      <h2>3. 개인정보의 제3자 제공</h2>
      <p>앱은 이용자의 개인정보를 제3자에게 제공하지 않습니다.</p>

      <h2>4. 개인정보 처리의 위탁</h2>
      <p>앱은 이용자의 개인정보를 외부 업체에 위탁하지 않습니다.</p>

      <h2>5. 개인정보의 보유 및 이용 기간</h2>
      <p>이용자의 개인정보는 회원탈퇴 시 즉시 파기됩니다.</p>

      <h2>6. 개인정보의 파기 절차 및 방법</h2>
      <p>파기 절차: 회원탈퇴 시 수집된 개인정보는 즉시 파기됩니다.</p>
      <p>파기 방법: 저장된 데이터베이스 값을 파기합니다.</p>

      <h2>7. 이용자의 권리</h2>
      <p>
        이용자는 언제든지 자신의 개인정보에 대해 열람, 수정, 삭제를 요구할 수 있으며, 개인정보 수집
        및 이용에 대한 동의 철회 및 탈퇴를 요청할 권리가 있습니다. 이러한 요청은 앱 내 설정 또는
        고객센터를 통해 가능합니다.
      </p>

      <h2>8. 개인정보의 안전성 확보 조치</h2>
      <p>앱은 이용자의 개인정보를 보호하기 위해 다음과 같은 조치를 취하고 있습니다:</p>
      <ul>
        <li>개인정보의 암호화</li>
        <li>개인정보 접근 제한</li>
      </ul>

      <h2>9. 개인정보처리방침의 변경</h2>
      <p>본 개인정보처리방침이 변경될 경우, 변경된 내용은 앱 내 인앱 알림을 통해 공지됩니다.</p>
    </>
  );
};

export default TermsOfUsePage;
